import React from 'react';
import {Link} from "react-router-dom";
import modal from "../../../img/modul.png";
import ekskluziv from "../../../img/ekskluziv.png";
import otzyv from "../../../img/otzyv.png";
import otzyv1 from "../../../img/otzyv2.png";
import otzyv2 from "../../../img/otzyv1.jpg";
import otzyv3 from "../../../img/otzyv3.jpg";

const Ios = () => {
    return (
        <div id='frBuy'>
            <div className="container">
                <div className="frBuy">
                    <h4>Главная / Наши курсы / <span>Ios - разработчик</span></h4>
                    <div className="frBuy--about">
                        <h1>Ios-разработчик</h1>
                        <div className="frBuy--about__title">
                            <p className='titleP'>создает приложения для устройств Apple. Это не только iPhone, но и
                                iPad, Apple Watch и другие гаджеты, входящие в экосистему. Он не только пишет код и
                                работает над интерфейсом, но и занимается поддержкой приложения, адаптацией его под
                                разные модели устройств, тестированием и исправлением багов. </p>
                            <div className="frBuy--about__title--dostup">
                                <p>Доступ:</p>
                                <h3>Навсегда</h3>
                                <p>В курс входит: </p>
                                <h3>3 модулей 60материалов</h3>
                            </div>
                        </div>
                        <Link to={'/frRegistration'}>
                            <button>Купить курс за 100 $</button>
                        </Link>
                    </div>
                </div>
                <div className="oKurse">
                    <h4>Что, как и почему</h4>
                    <div className="oKurse--about">
                        <h1>О КУРСЕ</h1>
                        <div className="oKurse--about__title">
                            <div className="oKurse--about__title--p">
                                <p>Это всё, что ты видишь и кликаешь на сайте или в приложении - картинки, кнопочки,
                                    анимации и даже бесячая реклама.</p>
                                <p>Самые главные инструменты frontend разработки сайтов это JavaScript, HTML и CSS.</p>
                                <p>В Кыргызстане фронтенд-разработчики востребованы практически в
                                    каждой IT-компании. Это также одно из самых популярных
                                    направлений для фриланса и удаленной работы. Все потому, что в
                                    современном мире сайт нужен каждому </p>
                            </div>
                            <div className="oKurse--about__title--dostup">
                                <p>Доступ:</p>
                                <h3>Навсегда</h3>
                                <p>В курс входит: </p>
                                <h3>3 модулей 60материалов</h3>
                            </div>
                        </div>
                    </div>
                </div>
                <div className="skils">
                    <h2>Для кого это </h2>
                    <ul>
                        <li>Для людей с математическим складом ума.</li>
                    </ul>
                    <div className="skils--about">

                        <div className="skils--about__title">
                            <h3>Вы изучтие</h3>
                            <ul>
                                <li>HTML</li>
                                <li>CSS</li>
                                <li>JavaScript</li>
                                <li>Soft skills. Нетехнические навыки</li>
                            </ul>
                        </div>
                        <div className="skils--about__title">
                            <ul>
                                <li>Кроссплатформенность и кроссбраузерность</li>
                                <li>Управление версиями</li>
                                <li>Тестирование и отладка</li>
                            </ul>
                        </div>
                    </div>
                    <div className="skils--result">
                        <h3>К каким результатам вас может привести этот курс?</h3>
                        <div className="skils--result__about">
                            <p>
                                С каждым днем, с каждым месяцем, с каждым годом вы будете физически ощущать, как ваши
                                мечты и цели воплощаются в реальность. И каждый день, каждый год вы будете видеть, что
                                вы
                                живете той жизнью, которую сами для себя выбрали, и именно по тому сценарию, который вы
                                сами для себя создали.</p>
                            <p>
                                Ваш новый навык планирования изменит вашу жизнь и поможет отточить умение выстраивать
                                дела в правильной последовательности. Сначала вы будете видеть на неделю вперед, потом -
                                на
                                месяц, потом - на год, а потом вы будете видеть весь свой путь. Система планирования
                                Кайдзен
                                позволит вам правильно планировать правильные вещи и увеличить степень контроля над
                                своей жизнью, чтобы сделать её счастливой и успешной.
                            </p>
                        </div>
                        <h4>Учитесь, применяйте полученные на курсе знания и будьте счастливы!</h4>
                        <div className="skils--result__btn">
                            <Link to={'/frRegistration'}>
                                <button className='btn1'>Купить курс</button>
                            </Link>
                            <a href="#skils--programma">
                                <button className='btn2'>Смотреть программу</button>
                            </a>
                        </div>
                    </div>

                    <div id='skils--programma' className="skils--programma">
                        <h1>ПРОГРАММА КУРСА</h1>
                        <div className="skils--programma__modulAll">
                            <div className="skils--programma__modulAll--main">
                                <div className="skils--programma__modulAll--main__modal">
                                    <h4>Модуль 1</h4>
                                    <p>Reactivity</p>
                                </div>
                                <div className="skils--programma__modulAll--main__modal">
                                    <h4>Модуль 2</h4>
                                    <p>Reactive approach</p>
                                </div>
                                <div className="skils--programma__modulAll--main__modal">
                                    <h4>Модуль 3</h4>
                                    <p>Observable example</p>
                                </div>
                                <div className="skils--programma__modulAll--main__modal">
                                    <h4>Модуль 4</h4>
                                    <p>Implementing and subscribing to an observer</p>
                                </div>
                                <div className="skils--programma__modulAll--main__modal">
                                    <h4>Модуль 5</h4>
                                    <p>Reactive Streams spec</p>
                                </div>
                                <div className="skils--programma__modulAll--main__modal">
                                    <h4>Модуль 6</h4>
                                    <p>Reactive Streams spec</p>
                                </div>
                            </div>
                            <img src={modal} alt=""/>
                        </div>
                        <Link to={"/register"}>
                            <button>Зарегистрироваться</button>
                        </Link>
                    </div>


                    <div className="skils--ekskluziv">
                        <div className="skils--ekskluziv__about">
                            <div className="skils--ekskluziv__about--card">
                                <svg width="89" height="99" viewBox="0 0 89 99" fill="none"
                                     xmlns="http://www.w3.org/2000/svg">
                                    <path
                                        d="M40.8989 69.0831L29.1856 80.0642L21.6551 87.2524C21.3655 87.5289 21.3517 87.9867 21.6241 88.2801L30.1465 97.4581C30.4236 97.7565 30.891 97.7714 31.1866 97.4913L79.6989 51.5132L81.529 49.6831L82.9932 47.4868L88.0449 37.0225C88.0928 36.9233 88.1177 36.8145 88.1177 36.7043V34.9787C88.1177 34.7846 88.0406 34.5984 87.9033 34.4611L87.234 33.7918C87.0967 33.6545 86.9105 33.5774 86.7164 33.5774H84.6255C84.5148 33.5774 84.4056 33.6025 84.3061 33.6507L72.4745 39.3873C72.4106 39.4183 72.3515 39.4584 72.2992 39.5064L67.9856 43.4604L40.8989 69.0831Z"
                                        stroke="white" stroke-width="0.366038"/>
                                    <path
                                        d="M76.4038 19.6679L57.9503 1.21442C57.813 1.07713 57.6268 1 57.4326 1H2.46479C1.00064 1.36604 1.36667 2.46415 1.36667 4.29434L1.00208 92.3727C1.00072 92.7004 1.0971 93.0211 1.27889 93.2938V93.2938C1.56443 93.7221 2.03371 93.9924 2.54748 94.0245L6.8205 94.2916C7.30142 94.3217 7.73676 94.5864 7.98467 94.9996L9.27011 97.142C9.58053 97.6594 10.1765 97.9333 10.7713 97.8321L26.9887 95.0717L23.3289 90.6792H4.66101V4.29434H54.9V19.6167C54.9 20.947 55.7819 22.1161 57.061 22.4816V22.4816C57.3272 22.5576 57.6027 22.5962 57.8795 22.5962H72.744M76.4038 19.6679V37.0652L72.744 38.8653V22.5962M76.4038 19.6679L72.744 22.5962M70.5472 18.9358L58.4679 6.8566V18.9358H70.5472Z"
                                        stroke="white" stroke-width="0.366038"/>
                                    <path
                                        d="M73.1089 58.1019L78.5995 52.9774L83.171 85.3298C83.2827 86.1201 82.8768 86.8934 82.1629 87.2504V87.2504C81.9847 87.3395 81.7933 87.3993 81.5961 87.4276L76.4033 88.1726V93.9736C76.4033 94.3396 67.2523 94.0468 35.041 94.3396L38.7014 90.6792M73.1089 58.1019L72.7429 90.6792H38.7014M73.1089 58.1019L65.4221 65.4226H67.6184V69.083H61.3957L53.8895 76.4038H69.4486V80.0641H50.0486L38.7014 90.6792"
                                        stroke="white" stroke-width="0.366038"/>
                                    <path
                                        d="M76.4043 64.6906C78.7469 80.2106 79.3326 84.5786 79.3326 84.4566L76.4043 84.8226V64.6906Z"
                                        stroke="white" stroke-width="0.366038"/>
                                    <rect x="8.1381" y="22.4132" width="32.5774" height="3.29434" stroke="white"
                                          stroke-width="0.366038"/>
                                    <rect x="8.1381" y="33.3943" width="58.9321" height="3.29434" stroke="white"
                                          stroke-width="0.366038"/>
                                    <path d="M8.1381 44.3755H66.7763L63.5221 47.3042L8.1381 47.6686V44.3755Z"
                                          stroke="white" stroke-width="0.366038"/>
                                    <path d="M8.1381 54.6245H55.8302L52.5359 57.9188H8.1381V54.6245Z" stroke="white"
                                          stroke-width="0.366038"/>
                                    <path d="M8.1381 65.6056H44.4015L40.9361 68.9H8.1381V65.6056Z" stroke="white"
                                          stroke-width="0.366038"/>
                                    <path d="M8.1381 76.5868H32.4038L29.1095 79.8811H8.1381V76.5868Z" stroke="white"
                                          stroke-width="0.366038"/>
                                </svg>
                                <h3>100 материалов</h3>
                                <p>Только полезная информация, никакой воды. Применяйте эти знания первыми!</p>
                            </div>
                            <div className="skils--ekskluziv__about--card">
                                <svg width="115" height="88" viewBox="0 0 115 88" fill="none"
                                     xmlns="http://www.w3.org/2000/svg">
                                    <path
                                        d="M32.8721 25.8352C32.8721 25.9731 27.8223 26.2491 7.62305 26.2491L29.5608 4.72528H42.3923L32.8721 25.8352Z"
                                        stroke="white" stroke-width="0.676647"/>
                                    <path
                                        d="M32.8721 28.7326C32.8721 28.5946 27.8223 28.7326 7.62305 28.7326L53.5681 77.9891L32.8721 28.7326Z"
                                        stroke="white" stroke-width="0.676647"/>
                                    <path
                                        d="M54.8097 75.9194C54.6717 76.0574 50.5877 66.8132 35.3555 28.7326H73.85L54.8097 75.9194Z"
                                        stroke="white" stroke-width="0.676647"/>
                                    <path
                                        d="M73.85 25.8352C73.85 25.9731 65.8199 26.2491 35.3555 26.2491L44.8756 4.72528H63.0881L73.85 25.8352Z"
                                        stroke="white" stroke-width="0.676647"/>
                                    <path
                                        d="M75.9194 5.13919C75.7814 5.00122 73.5187 4.72527 65.5714 4.72527L76.3333 26.2491H89.5788L89.9927 26.663V27.9048L89.1648 28.7326H76.3333L55.6374 77.989L96.6154 33.6996L97.4432 33.2857L98.685 33.6996L99.5128 34.5275L99.9267 35.7692L98.685 37.8388L53.9817 86.6813L1 27.4908V25.8352L26.663 1H78.4029L97.8571 17.5568L98.2711 18.7985L97.8571 20.4542L97.0293 21.696H94.9597L75.9194 5.13919Z"
                                        stroke="white" stroke-width="0.676647"/>
                                    <path
                                        d="M95.373 27.0769C100.754 27.4908 104.479 24.5934 104.893 17.5568L105.165 19.9995C105.259 20.8478 105.502 21.6728 105.884 22.4362C106.584 23.8365 107.72 24.9719 109.12 25.672L109.381 25.8025C109.974 26.0991 110.602 26.3218 111.249 26.4657L113.999 27.0769L112.091 27.554C111.16 27.7867 110.266 28.1462 109.432 28.6223L108.912 28.9197C108.17 29.3434 107.511 29.8964 106.964 30.5525C106.15 31.5292 105.611 32.7049 105.402 33.9589L104.893 37.011L104.296 33.7245C104.143 32.8862 103.849 32.0799 103.427 31.3401C102.761 30.1749 101.795 29.2093 100.63 28.5435L100.593 28.5224C99.8772 28.1133 99.1 27.8223 98.2915 27.6606L95.373 27.0769Z"
                                        stroke="white" stroke-width="0.676647"/>
                                </svg>
                                <h3>100% эксклюзив</h3>
                                <p>Курс записан эксклюзивно для нашей платформы</p>
                            </div>
                            <div className="skils--ekskluziv__about--card">
                                <svg width="125" height="125" viewBox="0 0 125 125" fill="none"
                                     xmlns="http://www.w3.org/2000/svg">
                                    <mask id="path-1-inside-1_612_2346" fill="white">
                                        <path
                                            d="M66.0434 23.1423C66.2047 21.3592 64.8903 19.7692 63.1001 19.744C57.4307 19.664 51.7917 20.7362 46.5244 22.9091C40.2554 25.4951 34.6973 29.5642 30.3205 34.7717C25.9437 39.9793 22.8771 46.1721 21.3802 52.8261C19.8833 59.48 20.0002 66.3992 21.721 72.998C23.4418 79.5969 26.7157 85.6811 31.2659 90.7357C35.816 95.7903 41.5083 99.6666 47.861 102.036C54.2137 104.406 61.0399 105.2 67.7617 104.35C73.4197 103.635 78.8637 101.773 83.7694 98.8889C85.3036 97.987 85.6646 95.9702 84.658 94.5026V94.5026C83.6419 93.0212 81.6202 92.6644 80.0582 93.5515C76.0235 95.8428 71.5754 97.3274 66.9591 97.911C61.2644 98.6308 55.4814 97.9585 50.0994 95.9508C44.7174 93.9431 39.8949 90.6591 36.04 86.3769C32.1852 82.0946 29.4115 76.9401 27.9537 71.3496C26.4959 65.7591 26.3968 59.8972 27.665 54.26C28.9332 48.6229 31.5312 43.3763 35.2391 38.9645C38.9471 34.5527 43.6559 31.1054 48.967 28.9145C53.2735 27.138 57.8732 26.2299 62.5064 26.2295C64.3 26.2294 65.8818 24.9286 66.0434 23.1423V23.1423Z"/>
                                    </mask>
                                    <path
                                        d="M66.0434 23.1423C66.2047 21.3592 64.8903 19.7692 63.1001 19.744C57.4307 19.664 51.7917 20.7362 46.5244 22.9091C40.2554 25.4951 34.6973 29.5642 30.3205 34.7717C25.9437 39.9793 22.8771 46.1721 21.3802 52.8261C19.8833 59.48 20.0002 66.3992 21.721 72.998C23.4418 79.5969 26.7157 85.6811 31.2659 90.7357C35.816 95.7903 41.5083 99.6666 47.861 102.036C54.2137 104.406 61.0399 105.2 67.7617 104.35C73.4197 103.635 78.8637 101.773 83.7694 98.8889C85.3036 97.987 85.6646 95.9702 84.658 94.5026V94.5026C83.6419 93.0212 81.6202 92.6644 80.0582 93.5515C76.0235 95.8428 71.5754 97.3274 66.9591 97.911C61.2644 98.6308 55.4814 97.9585 50.0994 95.9508C44.7174 93.9431 39.8949 90.6591 36.04 86.3769C32.1852 82.0946 29.4115 76.9401 27.9537 71.3496C26.4959 65.7591 26.3968 59.8972 27.665 54.26C28.9332 48.6229 31.5312 43.3763 35.2391 38.9645C38.9471 34.5527 43.6559 31.1054 48.967 28.9145C53.2735 27.138 57.8732 26.2299 62.5064 26.2295C64.3 26.2294 65.8818 24.9286 66.0434 23.1423V23.1423Z"
                                        stroke="white" stroke-width="1.19635" mask="url(#path-1-inside-1_612_2346)"/>
                                    <mask id="path-2-inside-2_612_2346" fill="white">
                                        <path
                                            d="M88.5733 33.0522C89.8591 31.8528 89.9377 29.8283 88.6449 28.6365C87.8005 27.858 86.9244 27.1146 86.0188 26.4081C84.6347 25.3282 82.6532 25.7322 81.6776 27.1917V27.1917C80.6983 28.6564 81.1051 30.6273 82.4792 31.7302C82.9871 32.1379 83.4838 32.5595 83.9686 32.9944C85.2786 34.1698 87.2863 34.2527 88.5733 33.0522V33.0522Z"/>
                                    </mask>
                                    <path
                                        d="M88.5733 33.0522C89.8591 31.8528 89.9377 29.8283 88.6449 28.6365C87.8005 27.858 86.9244 27.1146 86.0188 26.4081C84.6347 25.3282 82.6532 25.7322 81.6776 27.1917V27.1917C80.6983 28.6564 81.1051 30.6273 82.4792 31.7302C82.9871 32.1379 83.4838 32.5595 83.9686 32.9944C85.2786 34.1698 87.2863 34.2527 88.5733 33.0522V33.0522Z"
                                        stroke="white" stroke-width="1.19635" mask="url(#path-2-inside-2_612_2346)"/>
                                    <mask id="path-3-inside-3_612_2346" fill="white">
                                        <path
                                            d="M97.0369 42.9235C98.4835 41.924 98.8557 39.9324 97.7501 38.5652C97.0279 37.6722 96.2693 36.8092 95.4761 35.9785C94.2638 34.7088 92.2447 34.8202 91.067 36.1222V36.1222C89.8851 37.4289 90.0009 39.438 91.1999 40.729C91.6431 41.2063 92.0732 41.6957 92.4895 42.1965C93.6146 43.5499 95.5889 43.924 97.0369 42.9235V42.9235Z"/>
                                    </mask>
                                    <path
                                        d="M97.0369 42.9235C98.4835 41.924 98.8557 39.9324 97.7501 38.5652C97.0279 37.6722 96.2693 36.8092 95.4761 35.9785C94.2638 34.7088 92.2447 34.8202 91.067 36.1222V36.1222C89.8851 37.4289 90.0009 39.438 91.1999 40.729C91.6431 41.2063 92.0732 41.6957 92.4895 42.1965C93.6146 43.5499 95.5889 43.924 97.0369 42.9235V42.9235Z"
                                        stroke="white" stroke-width="1.19635" mask="url(#path-3-inside-3_612_2346)"/>
                                    <mask id="path-4-inside-4_612_2346" fill="white">
                                        <path
                                            d="M101.307 55.5608C103.038 55.255 104.207 53.5998 103.771 51.8962C103.487 50.7834 103.157 49.6829 102.782 48.5972C102.209 46.9377 100.327 46.1975 98.7144 46.8903V46.8903C97.0954 47.5856 96.3634 49.4601 96.9153 51.1334C97.1193 51.752 97.3063 52.376 97.476 53.0048C97.9348 54.704 99.5736 55.8668 101.307 55.5608V55.5608Z"/>
                                    </mask>
                                    <path
                                        d="M101.307 55.5608C103.038 55.255 104.207 53.5998 103.771 51.8962C103.487 50.7834 103.157 49.6829 102.782 48.5972C102.209 46.9377 100.327 46.1975 98.7144 46.8903V46.8903C97.0954 47.5856 96.3634 49.4601 96.9153 51.1334C97.1193 51.752 97.3063 52.376 97.476 53.0048C97.9348 54.704 99.5736 55.8668 101.307 55.5608V55.5608Z"
                                        stroke="white" stroke-width="1.19635" mask="url(#path-4-inside-4_612_2346)"/>
                                    <mask id="path-5-inside-5_612_2346" fill="white">
                                        <path
                                            d="M101.691 68.8928C103.434 69.1263 105.049 67.903 105.151 66.1476C105.217 65.001 105.236 63.8522 105.208 62.704C105.165 60.9489 103.596 59.6732 101.849 59.8445V59.8445C100.095 60.0164 98.8298 61.5809 98.8485 63.3427C98.8554 63.994 98.8445 64.6454 98.8157 65.296C98.7378 67.0543 99.9471 68.6592 101.691 68.8928V68.8928Z"/>
                                    </mask>
                                    <path
                                        d="M101.691 68.8928C103.434 69.1263 105.049 67.903 105.151 66.1476C105.217 65.001 105.236 63.8522 105.208 62.704C105.165 60.9489 103.596 59.6732 101.849 59.8445V59.8445C100.095 60.0164 98.8298 61.5809 98.8485 63.3427C98.8554 63.994 98.8445 64.6454 98.8157 65.296C98.7378 67.0543 99.9471 68.6592 101.691 68.8928V68.8928Z"
                                        stroke="white" stroke-width="1.19635" mask="url(#path-5-inside-5_612_2346)"/>
                                    <mask id="path-6-inside-6_612_2346" fill="white">
                                        <path
                                            d="M97.1308 81.5203C98.6617 82.3852 100.616 81.8505 101.363 80.2588C101.851 79.2192 102.296 78.1599 102.697 77.0836C103.31 75.4385 102.328 73.6707 100.643 73.1798V73.1798C98.9509 72.6871 97.1941 73.6686 96.5562 75.311C96.3203 75.9181 96.0679 76.5187 95.7991 77.1119C95.0729 78.7151 95.5985 80.6546 97.1308 81.5203V81.5203Z"/>
                                    </mask>
                                    <path
                                        d="M97.1308 81.5203C98.6617 82.3852 100.616 81.8505 101.363 80.2588C101.851 79.2192 102.296 78.1599 102.697 77.0836C103.31 75.4385 102.328 73.6707 100.643 73.1798V73.1798C98.9509 72.6871 97.1941 73.6686 96.5562 75.311C96.3203 75.9181 96.0679 76.5187 95.7991 77.1119C95.0729 78.7151 95.5985 80.6546 97.1308 81.5203V81.5203Z"
                                        stroke="white" stroke-width="1.19635" mask="url(#path-6-inside-6_612_2346)"/>
                                    <mask id="path-7-inside-7_612_2346" fill="white">
                                        <path
                                            d="M88.6642 91.8794C89.9021 93.1281 91.9281 93.1451 93.08 91.8166C93.8325 90.9489 94.5489 90.0506 95.2275 89.124C96.2648 87.7077 95.8007 85.7394 94.3123 84.8086V84.8086C92.8184 83.8743 90.8609 84.3409 89.8002 85.7479C89.4081 86.268 89.0019 86.7772 88.5819 87.275C87.4469 88.6201 87.4251 90.6295 88.6642 91.8794V91.8794Z"/>
                                    </mask>
                                    <path
                                        d="M88.6642 91.8794C89.9021 93.1281 91.9281 93.1451 93.08 91.8166C93.8325 90.9489 94.5489 90.0506 95.2275 89.124C96.2648 87.7077 95.8007 85.7394 94.3123 84.8086V84.8086C92.8184 83.8743 90.8609 84.3409 89.8002 85.7479C89.4081 86.268 89.0019 86.7772 88.5819 87.275C87.4469 88.6201 87.4251 90.6295 88.6642 91.8794V91.8794Z"
                                        stroke="white" stroke-width="1.19635" mask="url(#path-7-inside-7_612_2346)"/>
                                    <path
                                        d="M63.1077 19.4408V15.5906C63.1077 15.3407 63.396 15.201 63.5921 15.3559L73.3838 23.0861C73.537 23.2072 73.5351 23.4402 73.3799 23.5587L63.5882 31.0313C63.3914 31.1815 63.1077 31.0411 63.1077 30.7935V26.6189V19.4408Z"
                                        fill="#0A1128" stroke="white" stroke-width="0.598176"/>
                                    <path
                                        d="M56.2802 36.5468L84.2919 46.5312C84.7641 46.6995 85.0068 47.2221 84.8308 47.6915L83.8752 50.2396C83.7036 50.6972 83.1974 50.9333 82.7365 50.7707L54.5497 40.8224C54.058 40.6489 53.8173 40.0943 54.0263 39.6166L55.1569 37.0324C55.3457 36.6007 55.8363 36.3886 56.2802 36.5468Z"
                                        stroke="white" stroke-width="0.598176"/>
                                    <path
                                        d="M55.3311 41.5733C55.3284 41.5805 55.3338 41.5661 55.3311 41.5733ZM55.3311 41.5733C52.4269 49.4138 52.6244 51.6154 52.9121 52.2844C52.9284 52.3223 52.9511 52.3567 52.9767 52.3891L59.6263 60.7734C59.7461 60.9244 59.7857 61.124 59.7328 61.3094L59.3153 62.7707C59.2558 62.9788 59.0886 63.1385 58.878 63.1884L48.1409 65.7314C47.9598 65.7743 47.809 65.899 47.7329 66.0688L44.1704 74.0159C44.0518 74.2804 43.7607 74.4218 43.4795 74.3515L43.2757 74.3006C42.9855 74.228 42.6863 74.381 42.5752 74.6587L41.2053 78.0836C41.0793 78.3985 41.2401 78.755 41.5595 78.8691L69.7861 88.9501C70.071 89.0518 70.387 88.9248 70.5223 88.6542L72.1861 85.3267C72.3012 85.0964 72.2561 84.8183 72.074 84.6362L71.4288 83.991C71.2766 83.8388 71.2179 83.6165 71.2751 83.409L73.4952 75.3613C73.5455 75.1788 73.5065 74.9832 73.3899 74.834L66.2248 65.6627C66.1426 65.5575 66.0971 65.428 66.1024 65.2946C66.1199 64.8593 66.1936 64.2085 66.3971 64.0049C66.4497 63.9524 66.4936 63.8988 66.5301 63.8463C66.6889 63.6175 66.8884 63.3624 67.1599 63.2997L74.4123 61.6261C74.4523 61.6169 74.4913 61.6035 74.5285 61.5864L78.1533 59.9134C78.2868 59.8518 78.393 59.7431 78.4514 59.6081L81.9812 51.4625C82.1236 51.1339 81.9473 50.7546 81.6042 50.6517L79.8384 50.1219C79.5191 50.0261 79.183 50.2099 79.0914 50.5306L77.5059 56.0796C77.478 56.1773 77.4256 56.2663 77.3538 56.3382L75.196 58.4959C75.1142 58.5778 75.0104 58.6341 74.8972 58.6581L65.5096 60.6494C65.3163 60.6904 65.1558 60.8242 65.0806 61.0068L63.2396 65.4777C63.1577 65.6766 63.1889 65.9042 63.3214 66.0737L70.3867 75.1173C70.5101 75.2753 70.5462 75.4846 70.4828 75.6748L68.3808 81.9809C68.2763 82.2943 67.9376 82.4637 67.6242 82.3592L47.2591 75.5709C46.9326 75.462 46.7651 75.1008 46.8929 74.7812L49.0171 69.4708C49.0389 69.4162 49.0686 69.3652 49.1054 69.3193L50.1077 68.0664C50.1971 67.9546 50.3238 67.8786 50.4645 67.8522L55.0318 66.9958L60.4554 65.2831C60.62 65.2311 60.7541 65.1106 60.8233 64.9524L62.6619 60.7499C62.7517 60.5447 62.7193 60.3067 62.5781 60.1329L56.113 52.1757C55.4433 51.3515 55.2609 50.2339 55.6338 49.2396L56.8263 46.0596L57.8335 43.038C57.9379 42.7246 57.7686 42.3859 57.4552 42.2814L55.3311 41.5733Z"
                                        stroke="white" stroke-width="0.598176"/>
                                </svg>

                                <h3>В любое время, в любом месте</h3>
                                <p>Занимайтесь как вам удобно и где угодно, на своем мобильном или компьютере</p>
                            </div>
                        </div>
                        <center>
                            <div className="skils--ekskluziv__img">
                                <img src={ekskluziv} alt=""/>
                                <p>Мастер класс ведет</p>
                                <h1>Дмитрий Александрович</h1>
                                <h4>Ios developer</h4>
                            </div>
                        </center>
                    </div>
                    <div className="skils--obuchenie">
                        <h1>Процесс обучения</h1>
                        <div className="skils--obuchenie__all">
                            <div className="skils--obuchenie__all--card">
                                <h1>1</h1>
                                <h2>Мастер-класс</h2>
                                <p>Вы получите доступ ко всем урокам мастер-класса и другим дополнительным
                                    материалам</p>
                            </div>
                            <div className="skils--obuchenie__all--card">
                                <h1>2</h1>
                                <h2>Своё расписание</h2>
                                <p>Доступ к мастер-классам открыт 24/7. Вы сами решаете, когда у вас следующий урок</p>
                            </div>
                            <div className="skils--obuchenie__all--card">
                                <h1>3</h1>
                                <h2>Сообщество</h2>
                                <p>Вы сможете общаться и обмениваться мнениями с другими учениками в комментариях</p>
                            </div>
                            <div className="skils--obuchenie__all--card">
                                <h1>4</h1>
                                <h2>Доступ</h2>
                                <p>Мы предоставляем вам бессрочный доступ к материалам любого оплаченного
                                    мастер-класса</p>
                            </div>
                        </div>
                    </div>
                    <div className="skils--otzyv">
                        <h1>Отзывы наших студентов</h1>
                        <div className="skils--otzyv__all">
                            <div className="skils--otzyv__all--card">
                                <img src={otzyv} alt=""/>
                                <h3>Виктор Александарович</h3>
                                <p>С радостью оставляю положительной отзыв! Пройдя
                                    курс "UX/UI Designer с нуля" я с остался полностью
                                    доволен, что мой выбор пал именно на данную школу.
                                    Если вы выберите данную школу - вам обеспечена
                                    прокачка в выбранной вами области. Всячески рекомендую и благодарю!
                                </p>
                                <h4>23.02.2022 г</h4>
                            </div>
                            <div className="skils--otzyv__all--card">
                                <img src={otzyv1} alt=""/>
                                <h3>Алина Татьянован</h3>
                                <p>Лучшая школа в галактике и место, где я полюбил мир
                                    IT !!! Я вот-вот стану выпускником Motion Web. За это
                                    время мне дали фундаментальные знания программирования
                                    ( C++, C#, Python ), дискретной математики, криптографии,
                                    созданию сайтов со сложной серверной архитектурой и многим другим важным навыкам.
                                </p>
                                <h4>23.02.2022 г</h4>
                            </div>
                            <div className="skils--otzyv__all--card">
                                <img src={otzyv2} alt=""/>
                                <h3>Эрлан Токтошев</h3>
                                <p>Спасибо за обучение, все было правильно организовано и продумано.
                                    Дистанционное обучения это очень хорошо, потому что мы живем не в Ростове.
                                    Для нас это отлично. Второй этап обучение ребенку понравился больше, очень емко и
                                    содержательно.
                                </p>
                                <h4>23.02.2022 г</h4>
                            </div>
                            <div className="skils--otzyv__all--card">
                                <img src={otzyv3} alt=""/>
                                <h3>Влад Владимиров</h3>
                                <p>С радостью оставляю положительной отзыв! Пройдя
                                    курс "UX/UI Designer с нуля" я с остался полностью
                                    доволен, что мой выбор пал именно на данную школу.
                                    Если вы выберите данную школу - вам обеспечена
                                    прокачка в выбранной вами области. Всячески рекомендую и благодарю!
                                </p>
                                <h4>23.02.2022 г</h4>
                            </div>
                            <div className="skils--otzyv__all--card">
                                <img src={otzyv} alt=""/>
                                <h3>Вадим</h3>
                                <p>Мне очень нравиться Motion Web и я не разу не жалею о том
                                    что, что поступила в 8 классе. Там меня обучают основам
                                    программирования, которые полезны мне уже сейчас. Кроме того,
                                    я очень люблю это место за душевное,человеческое отношение.
                                </p>
                                <h4>23.02.2022 г</h4>
                            </div>
                        </div>
                    </div>
                    <div className="skils--fao">

                    </div>
                </div>
            </div>
        </div>

    );
};

export default Ios;